Repository: ErikaIwakiri/DebianCorpus
Catalog: TmxMerged.tmx
Source language: en_us
Languages: pt_pt

source: However, later they'll apply a different logic (sometimes prompted by a manual intervention): they'll ignore the fact apache-common breaks stuff, and keep going with things that work; if it still doesn't work after we've done everything we can, too bad, but maybe it will work.
pt_pt: No entanto, posteriormente eles aplicarão uma lógica diferente (algumas vezes isso é requisitado por uma intervenção manual): eles ignorarão o fato de que o apache-common quebra coisas, e continuarão com o que funciona; se isto ainda não funcionar depois que nós fizermos tudo que podíamos, tudo bem, mas talvez isto irá funcionar.

source: Later they'll try all the random libapache-foo packages and see that they indeed work.
pt_pt: Posteriormente eles tentarão todos os pacotes libapache-foo e verificarão se eles realmente funcionam.

source: After everything's been tried, they check how many packages have been broken, work out if that's better or worse than what there was originally and either accept everything or forget about it.
pt_pt: Depois que tudo tiver sido tentado, eles verificam quantos pacotes foram quebrados, analisam se isto é melhor ou pior do que havia originalmente, e aceitam tudo ou esquecem tudo.

source: You'll see this in update_output.txt on recur: lines.
pt_pt: Você verá isto no update_output.txt nas linhas recur:.

source: basically says having already found that foo and bar make things better, I'm now trying baz to see what happens, even though that breaks things.
pt_pt: basicamente diz que, já tendo descoberto que foo e bar tornam as coisas melhores, eu estou agora tentando baz para ver o que acontece, mesmo sabendo que vai quebrar algo.

source: The lines of update_output.txt that start with accepted indicate things that appear to make things better, and skipped lines make things worse.
pt_pt: As linhas do update_output.txt que começam com accepted (aceito) indicam algo que parece tornar as coisas melhores, e linhas skipped (ignorado) indicam algo que deixam as coisas piores.

source: The update_output.txt file is completely unreadable!
pt_pt: O arquivo update_output.txt é completamente ilegível!

source: That is not a question. ;-)
pt_pt: Isto não é uma questão. ;-)

source: Let's take an example:
pt_pt: Vamos pegar um exemplo:

source: This means that if cln goes into testing, ginac-cint and libginac-dev become uninstallable in testing on i386.
pt_pt: Isto significa que se o cln entrar na testing, ginac-cint e libginac-dev tornam-se não instaláveis na testing no i386.

source: Note that the architectures are checked in alphabetical order and only the problems on the first architecture with problems are shown — that's why the alpha architecture is shown so often.
pt_pt: Note que as arquiteturas são verificadas em ordem alfabética e que somente os problemas na primeira arquitetura problemática são mostrados — é por isso que a arquitetura alpha é mostrada tão frequentemente.

source: The got line includes the number of problems in testing on the different architectures (until the first architecture where a problem is found — see above). The i-45 means that if cln would go into testing, there would be 45 uninstallable packages on i386.
pt_pt: A linha got inclui o número de problemas na testing nas diferentes arquiteturas (até a primeira arquitetura onde um problema é encontrado — veja acima). i-45 significa que se o cln fosse para a testing, haveria 45 pacotes não-instaláveis na i386.

source: Some of the entries above and below cln show there were 43 uninstallable packages in testing on i386 at the time.
pt_pt: Algumas das entradas acima e abaixo do cln mostram que havia 43 pacotes não-instaláveis na testing, na arquitetura i386 e naquele momento.

source: The skipped: cln (0) (150+4) line means that there are still 150 packages to go through after this package until this check of all packages is completed, and that 4 packages have been found already that won't be planned to be upgraded because they would break dependencies.
pt_pt: A linha skipped: cln (0) (150+4) significa que ainda há 150 pacotes para checar, após o pacote em questão, até que a verificação de todos os pacotes seja completada; e que 4 pacotes já estão planejados para não serem atualizados, pois quebrariam dependências.

source: The (0) is irrelevant, you can safely ignore it.
pt_pt: O (0) é irrelevante, você pode ignorá-lo sem receios.

source: Note that there are several checks of all packages in one testing script run.
pt_pt: Observe que há várias verificações de todos os pacotes em uma rodada dos scripts da testing.

source: Jules Bean initially assembled the frequently asked questions and answers.
pt_pt: Jules Bean organizou inicialmente as questões e respostas frequentemente feitas.

source: The following pages provide additional information about the current state of testing and the migration of packages from unstable to testing:
pt_pt: As páginas a seguir fornecem informações adicionais sobre o estado atual da testing e a migração de pacotes da instável para a testing:

source: · Statistics on binary packages that are out of date for testing, stable
pt_pt: · Estatísticas sobre pacotes binários que estão desatualizados para testing, estável (stable)

source: · Dependency problems in testing, stable
pt_pt: · Problemas de dependência em testing, estável (stable)

source: You might be interested in reading an older explanation email.
pt_pt: Você pode estar interessado em ler um antigo e-mail de explicação.

source: Its only major flaw is that it doesn't take the package pool into account, because that was implemented by James Troup after it was written.
pt_pt: Sua única grande falha é que ele não leva em conta o pool dos pacotes, porque isto foi implementado por James Troup depois que o e-mail foi escrito.

source: The testing code is available from ftp-master.
pt_pt: O código da testing está disponível em ftp-master.

source: Anthony Towns takes credit for the implementation of testing.
pt_pt: Anthony Towns leva os créditos pela implementação da testing.

source: dansk Deutsch español français Italiano 한국어 (Korean) Nederlands Português Русский (Russkij) svenska 中文(简) 中文(HK) 中文(繁)
pt_pt: dansk Deutsch English español français Italiano 한국어 (Korean) Nederlands Русский (Russkij) svenska 中文(简) 中文(HK) 中文(繁)

source: Last Modified: Mon, Jul 13 20:32:34 UTC 2020 Last Built: Tue, Aug 6 19:40:15 UTC 2024
pt_pt: Última Modificação: Seg, 13 de Jul de 2020, 20:47:06 UTC Última compilação: Ter, 6 de Ago de 2024, 22:04:36 UTC

source: Copyright © 1997-2020 SPI and others; See license terms
pt_pt: Copyright © 1997-2020 SPI e outros; Veja os termos de licença

source: Documentation / Debian Books
pt_pt: Documentação / Livros Debian

source: Debian Books
pt_pt: Livros Debian

source: Dutch English French German Japanese Korean Spanish
pt_pt: Holandês Inglês Francês Alemão Japonês Coreano Espanhol

source: Dutch
pt_pt: Holandês

source: Author: Koen Wybo
pt_pt: Autor(a): Koen Wybo

source: Debian Release: 10/Buster
pt_pt: Versão Debian: 10/Buster

source: Publisher: pumbo
pt_pt: Editora: pumbo

source: Available at: https://www.boekenbestellen.nl/boek/debian-10/
pt_pt: Disponível em: https://www.boekenbestellen.nl/boek/debian-10/

source: Debian 9 is the must-have handbook for learning Linux.
pt_pt: Debian 9 é o manual imprescindível para aprender Linux.

source: Start on the beginners level and learn how to deploy the system with graphical interface and terminal.
pt_pt: Comece no nível iniciante e aprenda como implantar o sistema com interface gráfica e de terminal.

source: This book provides the basic knowledge to grow and become a 'junior' systems administrator.
pt_pt: Este livro fornece o conhecimento básico para crescer e se tornar um(a) administrador(a) de sistemas júnior.

source: Start off with exploring the GNOME desktop interface and adjust it to your personal needs.
pt_pt: Comece explorando a interface de área de trabalho GNOME e ajuste-a de acordo com suas necessidades pessoais.

source: Overcome your fear of using the Linux terminal and learn the most essential commands in administering Debian.
pt_pt: Supere seu medo de usar o terminal do Linux e aprenda os comandos mais essenciais na administração do Debian.

source: Expand your knowledge of system services (systemd) and learn how to adapt them.
pt_pt: Expanda seu conhecimento sobre serviços de sistema (systemd) e aprenda como adaptá-los.

source: Get more out of the software in Debian and outside of Debian.
pt_pt: Tire mais proveito do software no Debian e fora do Debian.

source: Manage your home-network with network-manager, etc.
pt_pt: Gerencie sua rede doméstica com o network-manager, entre outras coisas.

source: 10 percent of the profits on this book will be donated to the Debian Project.
pt_pt: 10% do lucro deste livro será doado ao projeto Debian.

source: English
pt_pt: Inglês

source: Author: Raphaël Hertzog, Roland Mas
pt_pt: Autor(a): Raphaël Hertzog, Roland Mas

source: Publisher: Freexian
pt_pt: Editora: Freexian

source: Available at: Lulu
pt_pt: Disponível em: Lulu

source: Written by two Debian developers, this free book started as a translation of their French best-seller known as Cahier de l'admin Debian (published by Eyrolles).
pt_pt: Escrito por dois desenvolvedores Debian, este livro, com licença de uso livre, começou como uma tradução do seu best-seller francês conhecido como Cahier de l'admin Debian (publicado pela Eyrolles).

source: Accessible to all, this book teaches the essentials to anyone who wants to become an effective and independent Debian GNU/Linux administrator.
pt_pt: Acessível a todos(as), este livro ensina o essencial a qualquer um(a) que queira se tornar um(a) administrador(a) Debian GNU/Linux eficaz e independente.

source: It covers all the topics that a competent Linux administrator should master, from the installation and the update of the system, up to the creation of packages and the compilation of the kernel, but also monitoring, backup and migration, without forgetting advanced topics like SELinux setup to secure services, automated installations, or virtualization with Xen, KVM or LXC.
pt_pt: Cobre todos os tópicos que um(a) administrador(a) de Linux competente deve dominar, desde a instalação e atualização do sistema, até a criação de pacotes e a compilação do kernel, mas também monitoramento, backup e migração, sem esquecer de tópicos avançados como configuração do SELinux para serviços seguros, instalações automáticas, ou virtualização com Xen, KVM ou LXC.

source: Author: Graham J Williams
pt_pt: Autor(a): Graham J Williams

source: Debian Release: 9/Stretch
pt_pt: Versão Debian: 9/Stretch

source: Publisher: Togaware
pt_pt: Editora: Togaware

source: The aim of this freely available book is to get you up to speed with Debian.
pt_pt: O objetivo deste livro, atualizado e livremente distribuído, é deixá-lo(a) familiarizado(a) com o Debian.

source: It is comprehensive with basic support for the user who installs and maintains the system themselves (whether in the home, office, club, or school).
pt_pt: É bastante detalhado no que diz respeito ao suporte básico ao(à) usuário(a) que instala e mantém o sistema por conta própria (seja em casa, no escritório, no clube ou na escola).

source: Some Debian specific information are very old.
pt_pt: Algumas informações específicas sobre o Debian são muito antigas.

source: French
pt_pt: Francês

source: Debian Release: 8/Jessie
pt_pt: Versão Debian: 8/Jessie

source: Publisher: Eyrolles
pt_pt: Editora: Eyrolles

source: Available at: Amazon, Eyrolles
pt_pt: Disponível em: Amazon, Eyrolles

source: The first French book about Debian is already in its fifth edition.
pt_pt: O primeiro livro francês sobre o Debian já está em sua quinta edição.

source: It covers all aspects of the administration of Debian from the installation to the configuration of network services.
pt_pt: Ele cobre todos os aspectos da administração do Debian, da instalação à configuração de serviços de rede.

source: Written by two Debian developers, this book can be of interest to many people: the beginner wishing to discover Debian, the advanced user looking for tips to enhance his mastership of the Debian tools and the administrator who wants to build a reliable network with Debian.
pt_pt: Escrito por dois desenvolvedores Debian, este livro pode ser de interesse para muitas pessoas: o(a) iniciante querendo descobrir o Debian, o(a) usuário(a) avançado procurando por dicas para melhorar sua maestria das ferramentas Debian, e o(a) administrador(a) que quer construir uma rede confiável com o Debian.

source: German
pt_pt: Alemão

source: Author: Axel Beckert, Frank Hofmann
pt_pt: Autor(a): Axel Beckert, Frank Hofmann

source: Publisher: Onyx Neon
pt_pt: Editora: Onyx Neon

source: The book covers topics ranging from concepts of package management over the available tools and how they're used to concrete problems which may occur in real life and how they can be solved.
pt_pt: O livro abrange tópicos que vão desde conceitos de gerenciamento de pacotes com as ferramentas disponíveis e como elas são usadas para problemas concretos que podem ocorrer na vida real, e como problemas podem ser resolvidos.

source: The book is written in German, an English translation is planned.
pt_pt: O livro é escrito em alemão, está prevista uma tradução para inglês.

source: Format: e-book (Online, HTML, PDF, ePub, Mobi), printed book planned.
pt_pt: Formato: e-book (on-line, HTML, PDF, ePub, Mobi), está prevista a versão impressa.

source: Author: Heike Jurzik
pt_pt: Autor(a): Heike Jurzik

source: Publisher: Rheinwerk Computing
pt_pt: Editora: Rheinwerk Computing

source: Available at: Amazon, Rheinwerk
pt_pt: Disponível em: Amazon, Rheinwerk

source: This book teaches you how to install and configure the system and also how to use Debian in a professional environment.
pt_pt: Este livro ensina como instalar e configurar o sistema, e também como usar o Debian em um ambiente profissional.

source: It shows the full potential of the distribution (in its current version 8) and provides a practical manual for all users who want to learn more about Debian and its range of services.
pt_pt: Mostra todo o potencial da distribuição (em sua versão atual 8) e fornece um manual prático para todos(as) os(as) usuários(as) que desejam aprender mais sobre o Debian e sua gama de serviços.

source: Author: Frank Ronneburg
pt_pt: Autor(a): Frank Ronneburg

source: Debian Release: 7/Wheezy
pt_pt: Versão Debian: 7/Wheezy

source: Publisher: Addison Wesley
pt_pt: Editora: Addison Wesley

source: Japanese
pt_pt: Japonês

source: Korean
pt_pt: Coreano

source: Author: 오 동진, 이 태희
pt_pt: Autor(a): 오 동진, 이 태희

source: Publisher: AcornPub
pt_pt: Editora: AcornPub

source: Available at: Yes24, Kyobobook, Aladin
pt_pt: Disponível em: Yes24, Kyobobook, Aladin

source: Written by two penetration researcher - Annihilator, Firstblood.
pt_pt: Escrito por dois pesquisadores de penetração - Annihilator, Firstblood.

source: This book teaches you how to build and configure Debian 8.x server system security hardening using Kali Linux and Debian simultaneously.
pt_pt: Este livro ensina como construir e configurar o hardening de segurança do sistema de servidor Debian 8.x usando Kali Linux e Debian simultaneamente.

source: DNS, FTP, SAMBA, DHCP, Apache2 webserver, etc.
pt_pt: DNS, FTP, SAMBA, DHCP, servidor web Apache2, etc.

source: From the perspective that 'the origin of Kali Linux is Debian', it explains how to enhance Debian's security by applying the method of penetration testing.
pt_pt: Da perspectiva de que 'a origem do Kali Linux é o Debian', explica como melhorar a segurança do Debian aplicando o método de teste de penetração.

source: This book covers various security issues like SSL cerificates, UFW firewall, MySQL Vulnerability, commercial Symantec antivirus, including Snort intrusion detection system.
pt_pt: Este livro aborda vários problemas de segurança, como certificados SSL, firewall UFW, Vulnerabilidade MySQL, antivírus comercial da Symantec, incluindo o sistema de detecção de intrusão Snort.

source: Spanish
pt_pt: Espanhol

source: Available at: Lulu, Amazon
pt_pt: Disponível em: Lulu, Amazon

source: Adding new Debian books
pt_pt: Adicionando novos livros Debian

source: If you would like to have your book mentioned here, send mail in English to <books@debian.org>.
pt_pt: Se você gostaria de ter seu livro mencionado aqui, envie um e-mail em inglês para <books@debian.org>.

source: Please include the following information:
pt_pt: Por favor inclua as informações a seguir:

source: · Book title,
pt_pt: · Book title (Título do livro),

source: · Author,
pt_pt: · Author (Autor),

source: · Publisher,
pt_pt: · Publisher (Editora),

source: · Language(s) the book is written in,
pt_pt: · Language(s) the book is written in (Idioma(s) no(s) qual(is) o livro está escrito),

source: · A URL to a page describing the book, or at least to the organisation,
pt_pt: · A URL to a page describing the book, or at least to the organisation, (uma URL para uma página que descreva o livro, ou pelo menos a organização),

source: · Email address for customer enquiries,
pt_pt: · Email address for customer enquiries (Endereço de e-mail para perguntas de clientes),

source: · What CDs are included with the book, and
pt_pt: · What CDs are included with the book (Quais CDs acompanham o livro) e,

source: · A brief description or blurb about the book, around 50 words or so (in english).
pt_pt: · A brief description or blurb about the book, around 50 words or so (in english) (Uma breve descrição ou sinopse sobre o livro, em torno de mais ou menos 50 palavras em inglês).

source: Removing Debian Books
pt_pt: Removendo livros Debian

source: We can remove a book if it uses an unmaintained distribution as explanation basis (older than oldstable).
pt_pt: Nós podemos remover um livro que usa como base de explicação uma distribuição não mais mantida (mais antiga que a oldstable).

source: You can request the removal of your book too.
pt_pt: Você também pode solicitar a remoção de um livro seu.

source: It's useful if the book become out of print for example.
pt_pt: Isso é útil se o livro, por exemplo, tem edição esgotada e está fora de catálogo.

source: Please use the method advised in previous paragraph to contact us.
pt_pt: Por favor, utilize o método sugerido no parágrafo acima para entrar em contato conosco.

source: dansk Deutsch Ελληνικά (Ellinika) español français Indonesia Italiano Nederlands 日本語 (Nihongo) polski Português Русский (Russkij) suomi svenska 中文(简) 中文(HK) 中文(繁)
pt_pt: dansk Deutsch Ελληνικά (Ellinika) English español français Indonesia Italiano Nederlands 日本語 (Nihongo) polski Русский (Russkij) suomi svenska 中文(简) 中文(HK) 中文(繁)

source: Last Modified: Sun, Sep 10 05:04:06 UTC 2017 Last Built: Tue, Aug 6 19:44:15 UTC 2024
pt_pt: Última Modificação: Seg, 8 de Jun de 2020, 05:13:45 UTC Última compilação: Ter, 6 de Ago de 2024, 22:06:33 UTC
